[
    {
      "que": "How can I check my traffic fine in Haryana?",
      "ans": "To check your traffic fine in Haryana, visit the Parivahan website and enter either your challan number, driving license number, or vehicle number. This platform will provide comprehensive details about your e-challan, including the option to download the fine receipt."},
    {
      "que": "How can I check my bike fine in AP?",
      "ans": "In Andhra Pradesh, you can check your bike fine online by accessing the E-challan Parivahan website. Navigate to “Check Online Services” and select “Check Challan Status”. Enter your e-challan number, complete the captcha, and click “Get Detail” to view your challan status."},
    {
      "que": "How can I check my bike fine online in Kerala?",
      "ans": "Visit Kerala Transport’s official website to access the e-challan Parivahan link. Once redirected, enter your challan number, driving license number, or vehicle number to view your e-challan details."},
    {
      "que": "How can I check my traffic fines online in Karnataka?",
      "ans": "Visit the Parivahan website and select “Check Online Services”. Choose “Check Challan Status”, enter your challan or vehicle number, and the status of your e-challan will be displayed."},
    {
      "que": "How to pay challan online in Haryana?",
      "ans": "For paying an online challan in Haryana, visit the E-Gras Haryana website. If you have an account, log in, or proceed without logging in. Choose PoliceFees and Challan of Vehicles, then select the applicable District, Treasury, Office Name, and Period. Follow the instructions to complete the payment."},
    {
      "que": "What is the time limit for challan in Haryana?",
      "ans": "In Haryana, traffic challans typically have a validity of 60 days. It's crucial to clear your fines within this period, either online or by direct payment to traffic police, to avoid additional complications."},
    {
      "que": "How can I check my bike fine in India?",
      "ans": "Nationwide, you can check your bike fine via the Parivahan website. Under the e-challan System, enter your vehicle’s registration number and the last 5 digits of the chassis or engine number. The site will display all relevant e-challan details."},
    {
      "que": "How do I pay my RTO fine online in AP?",
      "ans": "To pay a traffic e-challan online in Andhra Pradesh, visit the AP Police E-challan website, search for your vehicle's challan, and choose any unpaid challans. Follow the prompts for online payment."},
    {
      "que": "What is the AP traffic fine app?",
      "ans": "AP eChallan is Andhra Pradesh Police's official traffic e-challan app, offering a user-friendly platform for managing and paying traffic fines seamlessly."},
    {
      "que": "What is a challan in India?",
      "ans": "In Indian English, 'challan' refers to an official document or receipt used in various professional and financial contexts. It typically signifies a form of acknowledgment or proof, often used in police citations or financial transactions."},
    {
      "que": "How do I pay a traffic violation?",
      "ans": "Traffic fines can be paid online through the issuing authority’s website (like MMDA, LTO, or LGU) or in person at their offices. Follow the provided steps to complete the payment."},
    {
      "que": "How can I pay my MVD fine in Kerala?",
      "ans": "In Kerala, you can pay your MVD fine on the Paytm website. Go to the 'Challan Bill Payment' section, select the 'Traffic Authority', enter the required details such as Challan ID or vehicle number, and proceed to view and pay the fine amount."},
    {
      "que": "Where can I check traffic fines online in India?",
      "ans": "To check Emirates ID fines, visit the official portal (such as Abu Dhabi Police or Dubai Police) or go to a service center. Log in with the necessary details to view any outstanding fines and make payments if required."},
    {
      "que": "What is public eye complaint?",
      "ans": "Public Eye is an initiative that allows citizens to contribute to traffic violation reporting. Users can upload pictures of violations along with details, which are then reviewed by traffic police for action."},
    {
      "que": "How can I check my traffic fine online in India?",
      "ans": "To check your traffic fine in India, visit the Parivahan website, navigate to the e-challan System, and enter your vehicle's registration number and the last 5 digits of the chassis or engine number. This will provide detailed information about your e-challan."},
    {
      "que": "What is the helmet challan in Haryana?",
      "ans": "In Haryana, the fine for riding without a helmet is ₹1,000. This applies to both riders and pillions and was increased following the amended Motor Vehicle Act."},
    {
      "que": "What is the challan for no helmet in Haryana?",
      "ans": "In Haryana, the penalty for not wearing a helmet while riding a two-wheeler is ₹1,000. This is the same for pillions and was increased from the previous amount of ₹500 under the amended Motor Vehicle Act."},
    {
      "que": "How can I check my police challan in Gurgaon?",
      "ans": "To check a police challan in Gurgaon, visit the Parivahan portal, select 'check e-challan status', enter your challan number, vehicle number, or driving license number along with the captcha code, and click 'get details' to view your challan information."
    }
  ]